Revit 2026 API
SketchEditScope Class
 A SketchEditScope allows an application to create and maintain an editing session for a Sketch.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EditScope
 Autodesk.Revit.DB.SketchEditScope
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class SketchEditScope : EditScope
Public Class SketchEditScope
	Inherits EditScope
public ref class SketchEditScope : public EditScope
type SketchEditScope =
    class
        inherit EditScope
    end
The SketchEditScope type exposes the following members.
Constructors
Name | Description
SketchEditScope |  Instantiates a SketchEditScope object.
Top
Properties
Name | Description
IsActive |  Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
(Inherited from EditScope)
IsPermitted |  Tells if the edit scope is permitted to start.
(Inherited from EditScope)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from EditScope)
Top
Methods
Name | Description
Cancel |  Cancels the edit scope.
(Inherited from EditScope)
Commit |  Finishes the edit scope.
(Inherited from EditScope)
Dispose
(Inherited from EditScope)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsElementWithoutSketch |  Validates if an element can have a sketch but currently does not.
IsSketchEditingSupported |  Checks whether sketch can be edited.
IsSketchEditingSupportedForSketchBasedElement |  Checks whether the element supports sketch editing.
Start |  Starts a sketch edit mode.
StartWithNewSketch |  Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Start/end of a SketchEditScope will start/end a transaction group. After a SketchEditScope is started, an application can start transactions and edit the sketch. Individual transactions the application creates inside SketchEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into SketchEditScope constructor.
See Also
Reference
Autodesk.Revit.DB Namespace